---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.IsFaceSetOpen
source: html/0da2193e-aebc-5eb4-353e-ea72a12868bc.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.IsFaceSetOpen Property

Flag whether the current set of connected faces is open and
 additional tessellation faces can be added to it.

## Syntax (C#)
```csharp
public bool IsFaceSetOpen { get; }
```